       IDENTIFICATION DIVISION.
       PROGRAM-ID. condicao.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       77 SALDO-ATUAL     PIC 9(4)V99 VALUE 1500.50.
       77 VALOR-SAQUE     PIC 9(4)V99 VALUE 2000.00.

       PROCEDURE DIVISION.
           DISPLAY "SALDO DISPONIVEL: R$ " SALDO-ATUAL
           DISPLAY "VALOR DO SAQUE:   R$ " VALOR-SAQUE

           IF SALDO-ATUAL >= VALOR-SAQUE THEN
               DISPLAY "SAQUE AUTORIZADO!"
           ELSE
               DISPLAY "SALDO INSUFICIENTE!"
           END-IF.

           STOP RUN.
